[    
  
    
{
    "id": "q54xr2p0",
    "title": "Kasa",
    "cover": "/images/Kasa/Cover.webp",
    "pictures": [
      "/images/Kasa/Img.webp",
      "/images/Kasa/Img1.webp",
      "/images/kasa/Img2.webp",
      "/images/Kasa/Img3.webp",
      "/images/Kasa/Img4.webp",
      "/images/Kasa/Img5.webp"

    ],
    "description": " L'entreprise de location d'appartements entre particuliers, Kasa, a décidé d'entreprendre une refonte totale de son site web. L'objectif est de moderniser la plateforme en adoptant une stack technologique entièrement basée sur JavaScript. Ma mission était démarrer le projet en React et développer l'intégralité de l'application, conformément aux maquettes fournies via Figma"
,
    "skills": [
      "React",
      "Sass"
    ],
    "problematique":" La problématique rencontrée était de respecter les contraintes de React et React Router tout en découpant l'application en composants modulaires, sans utiliser des librairies externes et éviter les erreurs dans la console. La solution apportée était de structurer le projet avec des composants réutilisables, gérer mes routes dynamiquement avec React Router tout en appliquant Sass pour le style ",
   "lien": 
      "https://github.com/Oumayma-Hani-Bhouri/project-5_React"
     
  },
  {
    "id": "z82mp5d2",
    "title": "Portfolio",
    "cover": "/images/Portfolio/Cover.webp",
    "pictures": [
      "/images/Portfolio/Img.webp",
      "/images/Portfolio/Img1.webp",
      "/images/Portfolio/Img2.webp",
      "/images/Portfolio/Img3.webp",
      "/images/Portfolio/Img4.webp",
      "/images/Portfolio/Img5.webp"

    ],
    "description": " Ma mission pour ce projet était de créer un portfolio , déployer le site en ligne et optimiser son code et son référencement SEO",
    "skills": [
      "React",
      "Sass" ],
      "problematique":"La problématique rencontrée était de créer un portfolio professionel qui valorise mes compétences tout en en assurant une interface claire et cohérente et en optimisant mon temps. La solution apportée était d'utiliser des modèles de code existants pour gagner du temps, tout en retravaillant mes compétences en React et intégration.  ",
    "lien": 
      "https://github.com/Oumayma-Hani-Bhouri/Projet-8_Portfolio"
     
  },
  {
    "id": "h84dz5m3",
    "title": "Mon vieux grimoire",
    "cover": "/images/MonvieuxGrimoire/Cover.webp",
    "pictures": [
      "/images/MonvieuxGrimoire/Img.webp",
      "/images/MonvieuxGrimoire/Img1.webp",
      "/images/MonvieuxGrimoire/Img2.webp",
      "/images/MonvieuxGrimoire/Img3.webp",
      "/images/MonvieuxGrimoire/Img4.webp",
      "/images/MonvieuxGrimoire/Img5.webp"

    ],
    "description": "Un client souhaite ouvrir un site de notation de livres qui s'appelle Mon vieux Grimoire et permet aux membres d'ajouter un nouveau livre et de mettre une note visible par le public. Ma mission était de m'occuper de la partie Back-end"
,
    "skills": [
      "NodeJs",
      "Express",
      "Mongodb",
      "CRUD"
    ],
    "problematique":" La problématique rencontrée était de Développer une API pour un site de notation de livres, en collaboration avec un développeur front-end, tout en assurant l'optimisation des images et en respectant les bonnes pratiques du Green Code. La solution apportée était de développer un back-end conforme aux besoins du client, avec une API efficace pour gérer les fonctionnalités de référencement et de notation de livres. L'optimisation des images est également intégrée pour garantir des performances optimales",
    "lien": 
      "https://github.com/Oumayma-Hani-Bhouri/project-6_BackEnd"
     
  },

{
    "id": "h47as8y5",
    "title": "Nina Carducci",
    "cover": "/images/NinaCarducci/Cover.webp",
    "pictures": [
      "/images/NinaCarducci/Img.webp",
      "/images/NinaCarducci/Img1.webp",
      "/images/NinaCarducci/Img2.webp",
      "/images/NinaCarducci/Img3.webp",
      "/images/NinaCarducci/Img4.webp",
      "/images/NinaCarducci/Img5.webp"
    ],
    "description": "Nina Carducci une photographe émérite souhaite améliorer la visibilité de son site et optimiser son référencement sur les moteurs de recherche. Ma mission pour ce projet était:faire une optimisation globale du site, mettre en place le référencement local, ajouter les metas pour les réseaux sociaux et corriger les bugs. "
,
    "skills": [
      "LightHouse",
      "Chrome DevTools",
      "Wave"
    ],
    "problematique":"La Problématique rencontrée était de d'optimiser les performances et le référencement (SEO) du site de Nina Carducci, une photographe, tout en corrigeant certains bugs affectant la navigation et l'affichage des filtres dans sa galerie d'images. La solution était d'effectuer une optimisation complète du site en améliorant la performance des images, le SEO global, et l'accessibilité. De plus, j'ai mis en place un référencement local avec Schema.org, ajouté des metas pour les réseaux sociaux, et corrigé les bugs de navigation et d'affichage des filtres dans la galerie. Un rapport détaillant toutes les optimisations et leurs impacts a été fourni.",
    "lien": 
      "https://github.com/Oumayma-Hani-Bhouri/project-4_Debug-site"
     
    
  },

{
    "id": "j24sd4l2",
    "title": "Sophie Bluel",
    "cover": "/images/SophieBluel/Cover.webp",
    "pictures": [
      "/images/SophieBluel/Img.webp",
      "/images/SophieBluel/Img1.webp",
 "/images/SophieBluel/Img2.webp",
     "/images/SophieBluel/Img3.webp",
    "/images/SophieBluel/Img4.webp",
       "/images/SophieBluel/Img5.webp"
    ],
    "description": "L'agence ArchiWebos souhaite finir la conception du site d'une architecte d'intérieur. Ma mission était de développer la page de présentation des travaux de l'architecte,la page de connexion de l'administrateur su site et la modale permettant d'uploader de nouveaux médias "
,
    "skills": [
      "Html",
      "Css",
      "Javascript"
    ],
    "problematique":"La problématique rencontrée était de développer plusieurs nouvelles fonctionnalités tout en intégrant le design fourni. La solution était de suivre le tableau Kanban pour coder les pages et les modales demandées.",
    "lien": 
      "https://github.com/Oumayma-Hani-Bhouri/project-3_javascript"
},

    {
        "id": "c67ab8a7",
        "title": "Booki",
        "cover": "/images/Booki/Cover.webp",
        "pictures": [
          "/images/Booki/Img.webp",
          "/images/Booki/Img1.webp",
          "/images/Booki/Img2.webp",
          "/images/Booki/Img3.webp",
          "/images/Booki/Img4.webp",
          "/images/Booki/Img5.webp"
      ],
      "description": "La start-up Booki souhaite développer un site Internet qui permette aux usagers de trouver des hébergements et des activités dans la ville de leur choix. Ma mission était d'intégrer l'interface du site avec du code HTML et CSS.",
      "skills": [
        "Html",
        "Css",
        "Figma"
      ],
      "problematique":" La problématique était de développer un nouveau site permettant de rechercher des hébergements et des activités, avec un respect strict des spécifications fonctionnelles et techniques. La solution était d'intégrer l'interface du site en utilisant uniquement du HTML et du CSS, selon les maquettes fournies par l'UI designer.",
      "lien": 
        "https://github.com/Oumayma-Hani-Bhouri/project-2_html-css"

    }

]